# ChangeUnitsFormatWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..ChangeUnitsFormatWarn Property
BuiltInFailures..::..RebarFailures Class See Also
---
The modification of the unit will cause the change of the Reinforcement rounding format. Do you want to continue?
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ChangeUnitsFormatWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ChangeUnitsFormatWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ChangeUnitsFormatWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace